Revit 2027 API
Options.ComputeReferences Property
Determines whether or not references to geometric objects are computed.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool ComputeReferences { get; set; }
Public Property ComputeReferences As Boolean
	Get
	Set
public:
property bool ComputeReferences {
	bool get ();
	void set (bool value);
}
member ComputeReferences : bool with get, set
Property Value
Boolean
See Also
Reference
Options Class
Autodesk.Revit.DB Namespace